Revit 2024 API
BuiltInFailures.SketchFailures.LandingNotEnoughBoundaryCurves Property
 Sketch landing require boundaries
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LandingNotEnoughBoundaryCurves { get; }
Visual Basic
Public Shared ReadOnly Property LandingNotEnoughBoundaryCurves As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LandingNotEnoughBoundaryCurves {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace